{
  "shake_protein_fruit": {
    "title": "Протеинов Шейк с Плодове",
    "body": "Смесете 250 мл мляко или вода с 25 г протеин на прах и 150 г плодове (напр. банан, горски плодове). По желание добавете 1 с.л. пълнозърнест тахан или фъстъчено масло. Блендирайте до гладкост. Вариант за закуска или междинно хранене."
  },
  "eggs_with_veg": {
    "title": "Яйца със Свежи Зеленчуци",
    "body": "Пригответе 2 бр. яйца (бъркани, варени или омлет). Сервирайте със 100 г пресни зеленчуци като домати, краставици, чушки. Подходящо за закуска."
  },
  "sandwich_wholemeal": {
    "title": "Сандвич с Пълнозърнест Хляб",
    "body": "Пригответе сандвич с 2 филии пълнозърнест хляб, 20 г крема сирене и 50 г пресни зеленчуци. Вариант за закуска."
  },
  "smoothie_chia_fruit": {
    "title": "Смути с Чиа и Плодове",
    "body": "Смесете 250 мл мляко, 15 г чиа семена и 150 г плодове. Блендирайте до гладкост. Може да се консумира за закуска или междинно хранене."
  },
  "pancakes_healthy": {
    "title": "Здравословни Палачинки",
    "body": "Пригответе палачинки от 40 г пълнозърнесто или овесено брашно. Сервирайте със 100 г смес от сметана и парченца ягоди или банан. Подходящо за закуска."
  },
  "tortilla_sandwich": {
    "title": "Тортила Сандвич с Протеин",
    "body": "Използвайте 1 пълнозърнеста или нискогликемична тортила. Напълнете я със 75 г избран лек протеин (напр. пушена сьомга, накъсано пилешко), 20 г крема сирене или авокадова паста и 50 г пресни зеленчуци. Идеален за закуска."
  },
  "lunch_chicken_potato_salad": {
    "title": "Обяд: Пилешко с Картофи и Салата",
    "body": "200 г печено пилешко месо, 150 г сварени или печени картофи и 100 г салата с пресни зеленчуци."
  },
  "lunch_chicken_veg_bread": {
    "title": "Обяд: Пилешко със Задушени Зеленчуци и Хляб",
    "body": "200 г печено пилешко месо, 150 г задушени зеленчуци и 1 филия пълнозърнест хляб."
  },
  "lunch_beef_meatballs_potato_salad": {
    "title": "Обяд: Телешки Кюфтета с Пюре и Салата",
    "body": "150 г телешки кюфтета, 150 г картофи или картофено пюре и 100 г салата с пресни зеленчуци."
  },
  "lunch_beans_lentils_bread_salad": {
    "title": "Обяд: Боб или Леща със Салата и Хляб",
    "body": "300 г боб или леща, 1 филия пълнозърнест хляб и 100 г зелена салата."
  },
  "lunch_pork_veg_bread": {
    "title": "Обяд: Свинско със Задушени Зеленчуци и Хляб",
    "body": "200 г свинско месо (чисто, печено), 150 г задушени/печени зеленчуци и 1 филия пълнозърнест хляб."
  },
   "lunch_pork_potato_salad": {
    "title": "Обяд: Свинско с Картофи и Салата",
    "body": "200 г свинско месо, 150 г картофи или ориз и 100 г салата с пресни зеленчуци."
  },
  "lunch_cream_soup_cheese_bread": {
    "title": "Обяд: Крем-супа със Сирене и Хляб",
    "body": "250 мл крем-супа от зеленчуци, 40 г сирене и 1 филия пълнозърнест хляб или кротони."
  },
  "lunch_grilled_fish_potato_salad": {
    "title": "Обяд: Риба на Скара с Картофи и Салата",
    "body": "200 г риба, приготвена на скара, 150 г варени картофи и 100 г салата с пресни зеленчуци."
  },
   "lunch_moussaka_salad": {
    "title": "Обяд: Гръцка Мусака с Тиквички и Салата",
    "body": "200 г гръцка мусака с тиквички и 100 г зелена салата."
  },
  "lunch_pasta_meat_veg_salad": {
    "title": "Обяд: Пълнозърнеста Паста със Сос и Салата",
    "body": "200 г пълнозърнеста паста, 100 г доматен сос (с гъби или месо по избор) и 100 г зелена салата."
  },
  "lunch_chicken_soup_salad_bread": {
    "title": "Обяд: Пилешка Супа със Салата и Хляб",
    "body": "300 мл пилешка супа, 100 г салата от пресни зеленчуци и 1 филия пълнозърнест хляб."
  },
   "lunch_omelette_cheese_salad_bread": {
    "title": "Обяд: Омлет със Сирене, Салата и Хляб",
    "body": "120 г омлет или бъркани яйца със сирене, 200 г салата с пресни зеленчуци и 1 филия пълнозърнест хляб."
  },
  "lunch_peas_potato_salad": {
    "title": "Обяд: Постен Грах с Картофи и Салата",
    "body": "300 г постен грах с картофи и 200 г салата от пресни зеленчуци."
  },
  "dinner_salad_chicken": {
    "title": "Вечеря: Салата и Пилешко Месо",
    "body": "Голяма салата от пресни зеленчуци (350 г) и 200 г печено пилешко месо."
  },
   "dinner_salad_beef": {
    "title": "Вечеря: Салата и Телешко Месо",
    "body": "Голяма салата от пресни зеленчуци (350 г) и 150 г телешко месо."
  },
   "dinner_salad_pork": {
    "title": "Вечеря: Салата и Свинско Месо",
    "body": "Голяма салата от пресни зеленчуци (350 г) и 150 г чисто печено свинско месо."
  },
   "dinner_salad_fish": {
    "title": "Вечеря: Салата и Риба на Скара",
    "body": "Голяма салата от пресни зеленчуци (350 г) и 200 г риба, приготвена на скара."
  },
   "dinner_salad_moussaka": {
    "title": "Вечеря: Салата и Гръцка Мусака с Тиквички",
    "body": "Голяма салата от пресни зеленчуци (350 г) и 200 г гръцка мусака с тиквички."
  },
   "dinner_salad_omelette_cheese": {
    "title": "Вечеря: Салата и Омлет със Сирене",
    "body": "Голяма салата от пресни зеленчуци (350 г) и 120 г омлет или бъркани яйца със сирене."
  },
   "dinner_salad_beans_lentils": {
    "title": "Вечеря: Салата и Боб или Леща",
    "body": "Голяма салата от пресни зеленчуци (350 г) и 300 г боб или леща."
  },
   "dinner_salad_grilled_meat_veg": {
    "title": "Вечеря: Салата, Скара и Зеленчуци на Скара",
    "body": "Голяма салата от пресни зеленчуци (350 г), свински или телешки кюфтета на скара и 250 г зеленчуци на скара (чушки, тиквички, моркови)."
  },
   "snack_fruit_skyr": {
    "title": "Междинно Хранене: Плодов Скир",
    "body": "150 г плодов скир (или натурален скир с добавени пресни плодове)."
  },
  "snack_yogurt_fruit": {
    "title": "Междинно Хранене: Кисело Мляко с Плодове",
    "body": "180 г кисело мляко с парченца пресни плодове."
  },
  "snack_ricecakes_fiber": {
    "title": "Междинно Хранене: Оризовки с Фибри",
    "body": "30 г чисти оризовки с фибри. Може да се комбинират с малко крема сирене или авокадо."
  },
  "snack_fruit_choice": {
    "title": "Междинно Хранене: Плод по Избор",
    "body": "120 г от избран плод (ябълка, круша, шепа горски плодове и др.)."
  },
  "snack_nuts": {
    "title": "Междинно Хранене: Шепа Ядки",
    "body": "25 г сурови ядки (бадеми, орехи, кашу и др.). Избягвайте солени или печени."
  },
   "snack_protein_shake": {
    "title": "Междинно Хранене: Протеинов Шейк",
    "body": "250 мл протеинов шейк (25 г протеин). Вижте инструкциите за 'Протеинов Шейк с Плодове', ако искате да добавите плод или тахан."
  },
  "snack_protein_bar": {
    "title": "Междинно Хранене: Протеинов Бар",
    "body": "1 бр. протеинов бар (около 60 г). Изберете такъв с ниско съдържание на захар."
  },
   "snack_chia_fruit_yogurt": {
    "title": "Междинно Хранене: Чиа с Плодове и Кисело Мляко",
    "body": "150 г комбинация от кисело мляко, чиа семена и плодове. Сходно на смути, но по-плътно."
  }
}